Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ВариантыОтчетов/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуВариантовОтчета(Ключ, Организация = Неопределено, Автор = Неопределено, БезУдаленных = Истина) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникВариантыОтчетов.Наименование КАК Наименование,
		|	СправочникВариантыОтчетов.Ссылка КАК Ссылка,
		|	СправочникВариантыОтчетов.Общий КАК Общий,
		|	СправочникВариантыОтчетов.Автор КАК Автор,
		|	СправочникВариантыОтчетов.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА СправочникВариантыОтчетов.ПометкаУдаления
		|			ТОГДА 3
		|		КОГДА СправочникВариантыОтчетов.ПредопределенныйВариант
		|			ТОГДА 5
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Картинка
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК СправочникВариантыОтчетов
		|ГДЕ
		|	СправочникВариантыОтчетов.Ключ = &Ключ
		|	И &Организация
		|	И &Автор
		|	И &БезУдаленных
		|
		|УПОРЯДОЧИТЬ ПО
		|	СправочникВариантыОтчетов.ПредопределенныйВариант УБЫВ,
		|	СправочникВариантыОтчетов.Наименование";
	
	Запрос.УстановитьПараметр("Ключ", Ключ);
	
	Если Организация = Неопределено Тогда
		Запрос.УстановитьПараметр("Организация", Истина);
	Иначе
		УсловиеОрганизаця = "СправочникВариантыОтчетов.Организация В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), &Организация)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организация", УсловиеОрганизаця);
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли; 
	
	Если Автор = Неопределено Тогда
		Запрос.УстановитьПараметр("Автор", Истина);
	Иначе
		УсловиеАвтор = "(СправочникВариантыОтчетов.Общий
			|			ИЛИ СправочникВариантыОтчетов.Автор = &Автор)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Автор", УсловиеАвтор);
		Запрос.УстановитьПараметр("Автор", Автор);
	КонецЕсли; 
	
	Если БезУдаленных Тогда
		УсловиеБезУдаленных = "Не СправочникВариантыОтчетов.ПометкаУдаления";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&БезУдаленных", УсловиеБезУдаленных);
	Иначе
		Запрос.УстановитьПараметр("БезУдаленных", Истина);
	КонецЕсли; 
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
